tutorials/oldd/old/CYCLIC/0/init/boundaryUinlet
//        type            slip;
type fixedValue;
value uniform (.8944 4472 0);